'''
Задача 1:
Напишите программу, которая решает квадратные уравнения даже если дискриминант отрицательный.
Используйте комплексные числа для извлечения квадратного корня.
'''
a = int(input('Введите значение a: '))
b = int(input('Введите значение b: '))
c = int(input('Введите значение c: '))
x1 = None
x2 = None
d = (b ** 2) - (4 * a * c)
if d > 0:
    print(f"Дискриминант равен {d} > 0")
    x1 = (-b + d ** (1 / 2)) / (2 * a)
    x2 = (-b - d ** (1 / 2)) / (2 * a)
    print(f"x1 = {x1}; x2 = {x2}")
if d == 0:
    print(f"Дискриминант равен {d}")
    x1 = -b / (2 * a)
    print(f"x = {x1}")
if d < 0:
    print(f"Дискриминант равен {d} < 0")
    print('Корней нет, хотя постойте... Используем комплексные числа!')
    d = complex(b ** 2 - 4 * a * c, 0)
    x1 = (-b+d**0.5)/(2*a)
    x2 = (-b-d**0.5)/(2*a)
    print(f"d = {d}")
    print(f"x1 = {x1}")
    print(f"x2 = {x2}")