'''
Задание №4
Работа в консоли в режиме интерпретатора Python.
Решите квадратное уравнение 5x2
-10x-400=0 последовательно
сохраняя переменные a, b, c, d, x1 и x2.
*Попробуйте решить уравнения с другими значениями a, b, c.
'''
a = int(input('Введите значение a: '))
b = int(input('Введите значение b: '))
c = int(input('Введите значение c: '))
x1 = None
x2 = None
d = (b ** 2) - (4 * a * c)
if d > 0:
    print(f"Дискриминант равен {d} > 0")
    x1 = (-b + d ** (1 / 2)) / (2 * a)
    x2 = (-b - d ** (1 / 2)) / (2 * a)
    print(f"x1 = {x1}; x2 = {x2}")
if d == 0:
    print(f"Дискриминант равен {d}")
    x1 = -b / (2 * a)
    print(f"x = {x1}")
if d < 0:
    print(f"Дискриминант равен {d} < 0")
    print('Корней нет')
